proyecto_jjg/app/Controllers/Home.php

SELECT *
FROM `productos`
ORDER BY `id` DESC
---
    public function index()
    {
        $productoModel = new Producto_model();
        $dato['producto'] = $productoModel->orderBy('id', 'DESC')->findAll();