proyecto_jjg/app/Controllers/Usuario_controller.php

    public function formValidation()
    {
        $validationRules = [
            'nombre'        => 'required|min_length[3]',
            'apellido'      => 'required|min_length[3]|max_length[25]',
            'email'         => 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
            'usuario'       => 'required|min_length[3]|is_unique[usuarios.usuario]',
            'pass'          => 'required|min_length[3]|max_length[10]',
            'pass_confirm'  => 'required|min_length[3]|max_length[10]'
        ];

        $input = $this->validate($validationRules);

        if (!$input) {
            $data['titulo'] = 'Registro';
            echo view('front/head_view', $data);
            echo view('back/usuario/registro', ['validation' => $this->validator]);
        } else {
            $formModel = new Usuarios_model();

            $usuario = $this->request->getVar('usuario');
            $existingUser = $formModel->where('usuario', $usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'manuel'
 LIMIT 1

                return redirect()->to(base_url('/registro'));
            }

            $formModel->save([
                'nombre'    => $this->request->getVar('nombre'),
                'apellido'  => $this->request->getVar('apellido'),
                'usuario'   => $usuario,
                'email'     => $this->request->getVar('email'),
                'pass'      => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT)
            ]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('Manuel', 'Gomez', 'manuel', 'manuel@gmail.com', '$2y$10$bPmO10dHKMpu8GnYPd/DWufyVsenTABa/N/WTcYIZA73jEUJ2EwA6')