proyecto_jjg/app/Controllers/Ventas_controller.php

    public function comprarCarrito()
{
    $idSession = session();
    $cart = \Config\Services::cart();
    $productos = $cart->contents();
    $montoTotal = 0;
    $excedeStock = false; // Variable para verificar si se excede el stock
    $nombreProducto = '';

    foreach ($productos as $producto) {
        $montoTotal += $producto["price"] * $producto["qty"];

        $ventaCabecera = new Ventas_cabecera_model();
        $idSession = intval(session()->id);

        $fechaActual = date('Y-m-d'); // Obtener la fecha actual en el formato deseado

        $idCabecera = $ventaCabecera->insert([
            "total_venta" => $montoTotal,
            "usuario_id" => $idSession,
            "fecha" => $fechaActual // Agregar la fecha actual al array de datos
        ]);
---
INSERT INTO `ventas_cabecera` (`total_venta`, `usuario_id`, `fecha`) VALUES (400, 3, '2023-06-15')

        if ($stock >= $producto["qty"]) {
            // Actualizar el stock del producto
            $newStock = $stock - $producto["qty"];
            $productModel->update($producto["id"], ['stock' => $newStock]);
---
UPDATE `productos` SET `stock` = 21
WHERE `productos`.`id` IN ('23')